ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC7_SPI_1.0.xml
    <register id="UC7_SPI_CLKCTL" width="32" offset="0x1110" description="Clock prescaler and divider register.">
        <bitfield id="SCR" description="Serial clock divider:
This is used to generate the transmit and receive bit rate of the SPI.
The SPI bit rate is
(SPI's functional clock frequency)/((SCR+1)*2).
SCR is a value from 0-1023." begin="9" end="0" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DSAMPLE" description="Delayed sampling value. 
In controller mode the data on the input pin will be delayed sampled by the defined clock cycles of internal functional clock hence relaxing the setup time of input data. This setting is useful in systems where the board delays and external peripheral delays are more than the input setup time of the controller. Please refer to the datasheet for values of controller input setup time and assess what DSAMPLE value meets the requirement of the system.
Note: High values of DSAMPLE can cause HOLD time violations and must be factored in the calculations." begin="31" end="28" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC7_SPI_TXDATA" width="32" offset="0x1120" description="TXDATA Register">
        <bitfield id="DATA" description="Transmit Data
When read, last written value will be returned. If the last write to this field was a 32-bit write (with PACKEN=1), 32-bits will be returned and if the last write was a 16-bit write (PACKEN=0), those 16-bits will be returned.  
When written, one or two FIFO entries will be written depending on PACKEN value. Data values are removed from the transmit FIFO one value at a time by the transmit logic. It is loaded into the transmit serial shifter, then serially shifted out onto the TXD output pin at the programmed bit rate. 
When a data size of less than 16 bits is selected, the user must right-justify data written to the transmit FIFO. The transmit logic ignores the unused bits." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC7_SPI_RXDATA" width="32" offset="0x1124" description="RXDATA Register">
        <bitfield id="DATA" description="Received Data
When PACKEN=1,two entries of the FIFO are returned as a 32-bit value. When PACKEN=0, 1 entry of FIFO is returned as 16-bit value.
As data values are removed by the receive logic from the incoming data frame, they are placed into the entry in the receive FIFO, pointed to by the current FIFO write pointer.
Received data less than 16 bits is automatically right justified in the receive buffer." begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC7_SPI_CTL1" width="32" offset="0x114C" description="SPI control register 1">
        <bitfield id="LBM" description="Loop back mode" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable loopback mode"/>
            <bitenum id="ENABLE" value="0x1" description="Enable loopback mode"/>
        </bitfield>
        <bitfield id="CP" description="Controller or peripheral mode select. This bit can be modified only when SPI is disabled, CTL1.ENABLE=0." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Select Peripheral mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select Controller Mode"/>
        </bitfield>
        <bitfield id="POD" description="Peripheral-mode: Data output disabled
This bit is relevant only in Peripheral mode. In multiple-peripheral system topologies, SPI controller can broadcast a message to all peripherals, while only one peripheral drives the line. 
POD can be used by the SPI peripheral to disable driving data on the line." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPI can drive the POCI output in peripheral mode."/>
            <bitenum id="ENABLE" value="0x1" description="SPI cannot drive the POCI output in peripheral mode."/>
        </bitfield>
        <bitfield id="MSB" description="MSB first select. Controls the direction of the receive and transmit shift register." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="LSB first"/>
            <bitenum id="ENABLE" value="0x1" description="MSB first"/>
        </bitfield>
        <bitfield id="PREN" description="Parity receive enable
If enabled, parity reception check will be done for both controller and peripheral modes
In case of a parity miss-match the parity error flag RIS.PER will be set." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Parity receive function"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Parity receive function"/>
        </bitfield>
        <bitfield id="PES" description="Even Parity Select" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Odd Parity mode"/>
            <bitenum id="ENABLE" value="0x1" description="Even Parity mode"/>
        </bitfield>
        <bitfield id="ENABLE" description="SPI enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable module function"/>
            <bitenum id="ENABLE" value="0x1" description="Enable module function"/>
        </bitfield>
        <bitfield id="PTEN" description="Parity transmit enable
If enabled, parity transmission will be done for both controller and peripheral modes." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Parity transmission is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Parity transmission is enabled"/>
        </bitfield>
        <bitfield id="SUSPEND" description="Suspend external communication" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Functional mode resumed"/>
            <bitenum id="ENABLE" value="0x1" description="External communication suspended"/>
        </bitfield>
    </register>

</module>